In [113]:
import pandas as pd
import random
import numpy as np

1.1 Simplest operations

1. Create two simple datasets df1, df2 (a few lines, a few columns), similar in terms of dimensions

In [114]:
rand=np.random.randint(0,10,size=(3,3))
df1=pd.DataFrame(rand)
df2=pd.DataFrame(rand)
print("df1:\n" ,df1)
print("df2:\n" ,df2)

df1:
    0  1  2
0  0  9  5
1  7  7  3
2  4  0  6
df2:
    0  1  2
0  0  9  5
1  7  7  3
2  4  0  6

2. Each column should have a name (like a, b, c, d, etc.), values should be numbers generated randomly using numpy

In [115]:
df1.columns=("a","b","c")
df2.columns=("a","b","c")
print("df1:\n" ,df1)
print("df2:\n" ,df2)

df1:
    a  b  c
0  0  9  5
1  7  7  3
2  4  0  6
df2:
    a  b  c
0  0  9  5
1  7  7  3
2  4  0  6

3. For df1, change the value of the first line, first column, to NaN (missing value)

In [116]:
df1.at[0,"a"]=np.nan
#df1.loc[0,"a"]="x" â†’ also to replace values
df1

     a  b  c
0  NaN  9  5
1  7.0  7  3
2  4.0  0  6

4. Using fillna, change this missing value to 0

In [117]:
df0=df1.fillna(0)
df0

     a  b  c
0  0.0  9  5
1  7.0  7  3
2  4.0  0  6

5. Export df1 as a csv database

In [118]:
df0.to_csv("df1.csv")

6. Merge these datasets, once vertically, once horizontally, and display the results in your notebook

In [119]:
mergeh=pd.concat([df0,df2],axis=1)
mergeh

     a  b  c  a  b  c
0  0.0  9  5  0  9  5
1  7.0  7  3  7  7  3
2  4.0  0  6  4  0  6

In [120]:
mergev=pd.concat([df0,df2],axis=0)
mergev

     a  b  c
0  0.0  9  5
1  7.0  7  3
2  4.0  0  6
0  0.0  9  5
1  7.0  7  3
2  4.0  0  6

7. Gather all the columns of df into only one column using the melt function

In [121]:
melt=pd.melt(mergeh)
melt.head()

  variable  value
0        a    0.0
1        a    7.0
2        a    4.0
3        b    9.0
4        b    7.0

8. Create df3, a dataset modified from df1, where you have shifted the values of one column by one, downwards

In [122]:
df3=df0
df3

     a  b  c
0  0.0  9  5
1  7.0  7  3
2  4.0  0  6

In [123]:
df3["a"]=df3["a"].shift(1)
df3

     a  b  c
0  NaN  9  5
1  0.0  7  3
2  7.0  0  6